import Slider from "./Slider";

const slides = [
  {
    image: "/images/header-image (1).png",
    textHeading:
      "تعمل الأكاديمية العربية للبرمجة كجسر يربط العقول التكنولوجية العربية في المهجر بالطلبة العرب أينما كانوا",
    textDescription: [
      "تقدم الأكاديمية العربية للبرمجة تجربة تعلم متميزة من خلال مجموعة من الدروس والمناهج الاحترافية بجودة عالية",
      "وأسلوب تدريسي ممتع يتناسب مع مختلف الطرق التعليمية للمبتدئين والمحترفين بإشراف مدربين ومبرمجين ذوي خبرة عالمية في المجال التقني",
    ],
  },
  {
    image: "/images/header-image (1).png",
    textHeading:
      "تجربة تعليمية استثنائية مع الأكاديمية العربية للبرمجة",
    textDescription: [
      "نحرص دائمًا على تقديم محتوى تعليمي يساهم في تمكين وتطوير مهارات المبرمجين الناطقين باللغة العربية",
      "تستفيد من الخبرات العالمية لتقديم تجربة تعليمية احترافية",
    ],
  },
];

const HomeSlider = () => {
  return <Slider slides={slides} />;
};

export default HomeSlider;


